
### :robot: Terraform Report
---
##### Plan: `7` to add, `0` to change, `2` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.application_insights["aai10"].azurerm_application_insights.adl_appi[0] will be destroyed
  # (because module.application_insights["aai10"] is not in configuration)
  - resource "azurerm_application_insights" "adl_appi" {
      - app_id                                = "cd5c3136-34bf-4cc1-aab8-1954fee673be" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/686d8521-7611-440e-bbcd-8a996cbc0183/resourceGroups/rg-FHIR01/providers/Microsoft.Insights/components/appi-aai10" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = false -> null
      - internet_query_enabled                = false -> null
      - local_authentication_disabled         = false -> null
      - location                              = "northeurope" -> null
      - name                                  = "appi-aai10" -> null
      - resource_group_name                   = "rg-FHIR01" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "Environmentt" = "dev"
          - "Owner"        = "Walter"
          - "Project"      = "FHIR Patient Registry"
          - "Toolkit"      = "Terraform"
        } -> null
    }

  # module.application_insights["wgaai10"].azurerm_application_insights.adl_appi[0] will be created
  + resource "azurerm_application_insights" "adl_appi" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = false
      + internet_query_enabled                = false
      + local_authentication_disabled         = false
      + location                              = "northeurope"
      + name                                  = "appi-wgaai10"
      + resource_group_name                   = "rg-FHIR01"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Environmentt" = "dev"
          + "Owner"        = "Walter"
          + "Project"      = "FHIR Patient Registry"
          + "Toolkit"      = "Terraform"
        }
    }

  # module.key_vault["wgakv10"].azurerm_key_vault.adl_kv[0] will be created
  + resource "azurerm_key_vault" "adl_kv" {
      + access_policy                 = (known after apply)
      + enabled_for_deployment        = false
      + enabled_for_disk_encryption   = false
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "kv-wgakv10"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-FHIR01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "Environmentt" = "dev"
          + "Owner"        = "Walter"
          + "Project"      = "FHIR Patient Registry"
          + "Toolkit"      = "Terraform"
        }
      + tenant_id                     = "2f893724-9f76-4f3b-9174-dc602082a4d9"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.redis_cache["wgarc10"].azurerm_redis_cache.adl_redis[0] will be created
  + resource "azurerm_redis_cache" "adl_redis" {
      + capacity                      = 2
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "northeurope"
      + minimum_tls_version           = "1.2"
      + name                          = "redis-wgarc10"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "rg-FHIR01"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "Environmentt" = "dev"
          + "Owner"        = "Walter"
          + "Project"      = "FHIR Patient Registry"
          + "Toolkit"      = "Terraform"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
        }
    }

  # module.service_plan["aas10"].azurerm_service_plan.adl_sp[0] will be destroyed
  # (because module.service_plan["aas10"] is not in configuration)
  - resource "azurerm_service_plan" "adl_sp" {
      - id                           = "/subscriptions/686d8521-7611-440e-bbcd-8a996cbc0183/resourceGroups/rg-FHIR01/providers/Microsoft.Web/serverfarms/sp-aas10" -> null
      - kind                         = "functionapp" -> null
      - location                     = "northeurope" -> null
      - maximum_elastic_worker_count = 1 -> null
      - name                         = "sp-aas10" -> null
      - os_type                      = "Linux" -> null
      - per_site_scaling_enabled     = false -> null
      - reserved                     = true -> null
      - resource_group_name          = "rg-FHIR01" -> null
      - sku_name                     = "Y1" -> null
      - tags                         = {
          - "Environmentt" = "dev"
          - "Owner"        = "Walter"
          - "Project"      = "FHIR Patient Registry"
          - "Toolkit"      = "Terraform"
        } -> null
      - worker_count                 = 0 -> null
      - zone_balancing_enabled       = false -> null
    }

  # module.service_plan["wgaas10"].azurerm_service_plan.adl_sp[0] will be created
  + resource "azurerm_service_plan" "adl_sp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "northeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "sp-wgaas10"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-FHIR01"
      + sku_name                     = "Y1"
      + tags                         = {
          + "Environmentt" = "dev"
          + "Owner"        = "Walter"
          + "Project"      = "FHIR Patient Registry"
          + "Toolkit"      = "Terraform"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = false
    }

  # module.storage_account["wgfhirsta10"].azurerm_storage_account.adl_st[0] will be created
  + resource "azurerm_storage_account" "adl_st" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = true
      + large_file_share_enabled          = (known after apply)
      + location                          = "northeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "stwgfhirsta10"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-FHIR01"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "Environmentt" = "dev"
          + "Owner"        = "Walter"
          + "Project"      = "FHIR Patient Registry"
          + "Toolkit"      = "Terraform"
        }

      + queue_properties {
          + logging {
              + delete                = true
              + read                  = true
              + retention_policy_days = 10
              + version               = "1.0"
              + write                 = true
            }
        }
    }

  # module.storage_account["wgfhirsta10"].azurerm_storage_account_network_rules.firewall_rules[0] will be created
  + resource "azurerm_storage_account_network_rules" "firewall_rules" {
      + bypass                     = [
          + "AzureServices",
        ]
      + default_action             = "Allow"
      + id                         = (known after apply)
      + ip_rules                   = (known after apply)
      + storage_account_id         = (known after apply)
      + virtual_network_subnet_ids = (known after apply)
    }

  # module.storage_account["wgfhirsta10"].azurerm_storage_data_lake_gen2_filesystem.st_adls[0] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "st_adls" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "default"
      + owner              = (known after apply)
      + storage_account_id = (known after apply)
    }

Plan: 7 to add, 0 to change, 2 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#4458030664`](https://github.com/rett-spain/fhir-azure-resources/actions/runs/4458030664) - commit 3a6a8b902c92ed64941bd11e4593431cfc3d8425
